app/controllers/apps_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."app_id" = 1
---
  def index
    apps = App.all.map do |app|
      {
        id: app.id,
        name: app.name,
        dev_id: app.dev_id,                  # <-- додати
        photo_url: drive_direct_link(app.photo_path),
        is_game: app.is_game,
        rating: app.comments.any? ? app.comments.average(:rating).to_f.round(1) : 0