app/controllers/apps_controller.rb

INSERT INTO "apps" ("name", "description", "is_game", "dev_id", "cost", "size", "android_min_version", "ram_needed", "photo_path", "apk_path", "downloads_count", "created_at", "updated_at") VALUES ('MyGame', 'Test game', 1, 1, 0.0, 50.0, '5.0', '2GB', '', '', 0, '2025-10-12 13:19:14.432562', '2025-10-12 13:19:14.432562') RETURNING "id"
---
  def create
    drive = GoogleDriveService.new

    photo_link = params[:photo].present? ? drive.upload_file(
      params[:photo].tempfile.path,
      params[:photo].original_filename,
      params[:photo].content_type
    )[:view_link] : nil

    apk_link = params[:apk].present? ? drive.upload_file(
      params[:apk].tempfile.path,
      params[:apk].original_filename,
      params[:apk].content_type
    )[:view_link] : nil

    app = App.new(app_params.merge(
      dev_id: @current_user.id,
      photo_path: photo_link,
      apk_path: apk_link
    ))

    if app.save

SELECT "apps".* FROM "apps" WHERE "apps"."id" = 1 LIMIT 1
---
  def update
    app = App.find(params[:id])

UPDATE "apps" SET "name" = 'My Updated App', "description" = 'Новий опис для тесту', "cost" = 4.99, "size" = 200.0, "android_min_version" = '6.0', "ram_needed" = '3GB', "photo_path" = '/images/new_photo.png', "apk_path" = '/files/app_v2.apk', "downloads_count" = 2500, "updated_at" = '2025-10-21 10:28:35.167009' WHERE "apps"."id" = 1
---
    updatable_fields[:ram_needed] = params[:app][:ram_needed] if params[:app][:ram_needed].present?
    updatable_fields[:is_game] = params[:app][:is_game] unless params[:app][:is_game].nil?

    if app.update(updatable_fields)

SELECT "apps".* FROM "apps"
SELECT AVG("comments"."rating") FROM "comments" WHERE "comments"."app_id" = 1
---
  def index
    apps = App.all.map do |app|
      {
        id: app.id,
        name: app.name,
        dev_id: app.dev_id,
        photo_url: drive_thumbnail(app.photo_path),
        is_game: app.is_game,
        rating: app.comments.any? ? app.comments.average(:rating).to_f.round(1) : 0

SELECT "apps".* FROM "apps" WHERE "apps"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."app_id" = 1
---
  def show
    app = App.find_by(id: params[:id])
    return render json: { error: "App not found" }, status: :not_found unless app

    render json: {
      id: app.id,
      name: app.name,
      description: app.description,
      photo_url: drive_thumbnail(app.photo_path),
      apk_url: drive_download(app.apk_path),
      is_game: app.is_game,
      cost: app.cost,
      size: app.size,
      android_min_version: app.android_min_version,
      ram_needed: app.ram_needed,
      rating: app.comments.any? ? app.comments.average(:rating).to_f.round(1) : 0,
      dev: app.dev ? { id: app.dev.id, email: app.dev.email } : nil,
      comments: app.comments.includes(:user).map do |c|

SELECT "apps".* FROM "apps" WHERE "apps"."id" = 2 LIMIT 1
DELETE FROM "apps" WHERE "apps"."id" = 2
---
  def destroy
    app = App.find_by(id: params[:id])
    return render json: { error: "App not found" }, status: :not_found unless app
    return render json: { error: "Forbidden" }, status: :forbidden if app.dev_id != @current_user.id

    app.destroy