app/controllers/apps_controller.rb

UPDATE "apps" SET "name" = 'My Updated App', "description" = 'Новий опис для тесту', "cost" = 4.99, "size" = 200.0, "android_min_version" = '6.0', "ram_needed" = '3GB', "photo_path" = '/images/new_photo.png', "apk_path" = '/files/app_v2.apk', "downloads_count" = 2500, "updated_at" = '2025-10-21 10:28:35.167009' WHERE "apps"."id" = 1
---
        )
      )

      if app.save