app/controllers/comments_controller.rb

  def index
    comments = Comment.includes(:user)
---
SELECT "comments".* FROM "comments"

  def create
    existing = Comment.find_by(app_id: comment_params[:app_id], user_id: @current_user.id)

    if existing
      return render json: { error: "You already left a review for this app" }, status: :forbidden
    end

    comment = Comment.new(comment_params.merge(user_id: @current_user.id))

    if comment.save
      comment = Comment.includes(:user).find(comment.id)
---
INSERT INTO "comments" ("app_id", "user_id", "comment", "rating", "created_at", "updated_at") VALUES (1, 1, 'This is a test comment', 4, '2025-10-12 13:21:20.652723', '2025-10-12 13:21:20.652723') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1