app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'rat@example.com' LIMIT 1
---
  def create
    creds = params[:session] || params
    user = User.find_by(email: creds[:email])