app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password", "money_spent", "bought_apps", "card_info", "created_at", "updated_at", "password_digest") VALUES ('hro', NULL, NULL, NULL, NULL, '2025-10-18 17:16:24.430613', '2025-10-18 17:16:24.430613', '$2a$12$f6sleD0cfcafsC2XZjL8w.ZUOJlo9Ffjnq/S4pxuJspzetZwjt5Mu') RETURNING "id"